using System.IO;

namespace ClientCommon
{
	//=====================================================================================================================
	// 메세지 단위의 데이터 송수신에 처리될 데이터의 직렬화, 역직렬화 함수를 지원하는 추상 클래스
	//=====================================================================================================================
	public abstract class Body
	{
		////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
		// Member functions

		//=====================================================================================================================
		// 직렬화에 필요한 객체를 생성하며 완료된 직렬화 데이터를 외부로 반환하는 함수
		// Return : 직렬화된 데이터
		//=====================================================================================================================
		public byte[] SerializeRaw()
		{
			// 직렬화에 필요한 메모리 스트림과 직렬화 처리클래스 생성
			MemoryStream stream = new MemoryStream();
			PacketWriter writer = new PacketWriter(stream);

			// 직렬화 처리
			Serialize(writer);

			// 직렬화된 데이터 반환
			return stream.ToArray();
		}

		//=====================================================================================================================
		// 직렬화 처리를 하는 가상 함수
		//
		// writer : 직렬화 하여 내부 스트림에 저장하는 객체
		//=====================================================================================================================
		public virtual void Serialize(PacketWriter writer)
		{
		}

		//=====================================================================================================================
		// 역직렬화에 필요한 객체를 생성하여 역직렬화를 시작하는 함수
		// Return : 직렬화된 데이터
		//=====================================================================================================================
		public void DeserializeRaw(byte[] bytes)
		{
			// 역직렬화에 필요한 메모리 스트림과 역직렬화 처리클래스 생성
			MemoryStream stream = new MemoryStream(bytes);
			PacketReader reader = new PacketReader(stream);

			// 역직렬화 처리
			Deserialize(reader);
		}

		//=====================================================================================================================
		// 역직렬화 처리를 하는 가상 함수
		//
		// reader : 내부 스트림에서 역직렬화 하여 다시 사용할 수 있는 데이터로 변환하는 객체
		//=====================================================================================================================
		public virtual void Deserialize(PacketReader reader)
		{
		}
	}
}
