using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace ClientCommon
{
	//=====================================================================================================================
	// (CommandBody 상속) 영웅로그아웃 명령 데이터를 담고 있는 클래스
	//=====================================================================================================================
	public class HeroLogoutCommandBody : CommandBody
	{
	}

	//=====================================================================================================================
	// (ResponseBody 상속) 영웅로그아웃 명령의 응답 데이터를 담고 있는 클래스
	//=====================================================================================================================
	public class HeroLogoutResponseBody : ResponseBody
	{
	}
}
