using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace ClientCommon
{
	//=====================================================================================================================
	// (CommandBody 상속) 영웅로그인 명령 데이터를 담고 있는 클래스
	//=====================================================================================================================
	public class HeroLoginCommandBody : CommandBody
	{
		////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
		// Member variables

		// 영웅 ID
		public Guid heroId;

		////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
		// Member functions

		//=====================================================================================================================
		// 직렬화 처리를 하는 함수
		//
		// writer : 직렬화 하여 내부 스트림에 저장하는 객체
		//=====================================================================================================================
		public override void Serialize(PacketWriter writer)
		{
			base.Serialize(writer);

			writer.Write(heroId);
		}

		//=====================================================================================================================
		// 역직렬화 처리를 하는 함수
		//
		// reader : 내부 스트림에서 역직렬화 하여 다시 사용할 수 있는 데이터로 변환하는 객체
		//=====================================================================================================================
		public override void Deserialize(PacketReader reader)
		{
			base.Deserialize(reader);

			heroId = reader.ReadGuid();
		}
	}

	//=====================================================================================================================
	// (ResponseBody 상속) 영웅로그인 명령의 응답 데이터를 담고 있는 클래스
	//=====================================================================================================================
	public class HeroLoginResponseBody : ResponseBody
	{
		////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
		// Member variables

		//
		// 영웅 정보
		//

		// 영웅 ID
		public Guid heroId;
		// 영웅 이름
		public string name;
		// 영웅 캐릭터ID
		public int characterId;

		//
		// 위치 정보
		//

		// 입장 대륙ID
		public int enterContinentId;

		////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
		// Member functions

		//=====================================================================================================================
		// 직렬화 처리를 하는 함수
		//
		// writer : 직렬화 하여 내부 스트림에 저장하는 객체
		//=====================================================================================================================
		public override void Serialize(PacketWriter writer)
		{
			base.Serialize(writer);

			//
			// 영웅 정보
			//

			writer.Write(heroId);
			writer.Write(name);
			writer.Write(characterId);

			//
			// 위치 정보
			//

			writer.Write(enterContinentId);
		}

		//=====================================================================================================================
		// 역직렬화 처리를 하는 함수
		//
		// reader : 내부 스트림에서 역직렬화 하여 다시 사용할 수 있는 데이터로 변환하는 객체
		//=====================================================================================================================
		public override void Deserialize(PacketReader reader)
		{
			base.Deserialize(reader);

			//
			// 영웅 정보
			//

			heroId = reader.ReadGuid();
			name = reader.ReadString();
			characterId = reader.ReadInt32();

			//
			// 위치 정보
			//

			enterContinentId = reader.ReadInt32();
		}
	}
}
